---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StairsDbgShowRunOutlineForPlan
source: html/46000dbb-5c53-478f-35c9-de584f93c8ae.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StairsDbgShowRunOutlineForPlan Property

"Show Run Outline For Plan"

## Syntax (C#)
```csharp
public static ForgeTypeId StairsDbgShowRunOutlineForPlan { get; }
```